import React from 'react';

let Main = ()=>{
    return(
        <div className="z2">
            <h2>اهلا وسهلا بكم في موقعنا مكتبة الخوارزمي للعلوم الرياضية </h2>
            <h3>نبذة مختصرة عن الرياضيات</h3>
            <div className="z5">كان علم الرياضيات منذ القدم أحد العلوم التي انشغل بها العديد من العلماء لأهميتها الكبيرة، إلّا أنّ الرياضيات في الأزمان القديمة لم يكن متسّعاً كما هو عليه الآن، ولهذا تطور تعريفه مع تطور الزمن، فعلى سبيل المثال عرف أرسطو الرياضيات بأنّه علم الكم، وكما نعلم أنّ الكم هو جزءٌ من الرياضيات؛ فالرياضيات يبحث في العديد من الأمور الأخرى</div><br/><br/>
            <div className="z5">عرّف آخرون الرياضيات على أنّه علم القياس غير المباشر، وهو ما قاله الفيلسوف الفرنسي أوغست كنت في الرياضيات، لأنّه من خلاله يتمّ قياس العديد من الأمور المختلفة كالمسافة بين الكواكب وحجم الذرات وغيرها، وهي التي لا يمكن لنا قياسها بشكلٍ مباشر، إنّما يتم قياسها نسبةً إلى علاقتها مع الكميات</div>
       

        </div>
    );
};
export default Main ;